In [1]:
import numpy as np
import pandas as pd

In [2]:
dados = {
    'Nome':['Maria','Joao','Ana'],
    'Idade': [25,32,28]
}
df = pd.DataFrame(dados)
df

    Nome  Idade
0  Maria     25
1   Joao     32
2    Ana     28

In [4]:
#Metodo assign permite criar novas colunas 
#Utiliza-se lambda
df = df.assign(Ano_nascimento = lambda x: 2025 - x['Idade'])
df.head()

    Nome  Idade  Ano_nascimento
0  Maria     25            2000
1   Joao     32            1993
2    Ana     28            1997

In [7]:
#Metodo transform
dados = {
    'Grupo': ['A','B','A','B'],
    'Valor':[10,20,30,40]
}
df = pd.DataFrame(dados)


#Aplicar operaçao media por grupo usando transform

df['Media_Grupo'] = df.groupby('Grupo')['Valor'].transform('mean')
df.head()

  Grupo  Valor  Media_Grupo
0     A     10         20.0
1     B     20         30.0
2     A     30         20.0
3     B     40         30.0

In [8]:
#Metodo Apply usado para aplicar uma função a cada linha ou coluna

dados = {
    'Valor1': [10,20,30],
    'Valor2':[5,10,15]
}
df = pd.DataFrame(dados)
df.head()

   Valor1  Valor2
0      10       5
1      20      10
2      30      15

In [10]:
#Usando metodo apply, multiplicando colunas do valor 1 por 2 e atribuindo em uma coluna
df['Resultado'] = df.apply(lambda row: row['Valor1'] * row['Valor2'], axis=1)
df.head()

   Valor1  Valor2  Resultado
0      10       5         50
1      20      10        200
2      30      15        450

In [14]:
#É POSSIVEL tambem usar funcoes ao inves de lambda
def verifica_resultado(Resultado):
    if(Resultado >=200):
        return 'Vendas acima de 200'
    else:
        return 'Vendas abaixo de 200'

#Aplicar a funcao do apply no metodo
df['Avaliacao'] = df['Resultado'].apply(verifica_resultado)
df.head()

   Valor1  Valor2  Resultado             Avaliacao
0      10       5         50  Vendas abaixo de 200
1      20      10        200   Vendas acima de 200
2      30      15        450   Vendas acima de 200